codeigniter-project/app/Controllers/Book.php

    public function index(){
        $session=\Config\Services::session();
        $data['session']=$session;
        $model=new BookModel();
        $data['books']=$model->orderBy('id','ASC')->findAll();
---
SELECT *
FROM `books`
ORDER BY `id` ASC

    public function delete($id){
        $session=\Config\Services::session();
        $model=new BookModel();
        $book=$model->getRow($id);
      if(empty($book)){
        $session->setFlashdata('error','No Data Found..');
        return redirect()->to('books');
      }
      $model->delete($id);
---
DELETE FROM `books`
WHERE `id` IN ('3')