codeigniter-project/app/Controllers/StudentController.php

SELECT *
FROM `student`
ORDER BY `id`
---
    public function index()
    {
        $session = \Config\Services::session();
        $data['session'] = $session;
        $model = new StudentModel();
        $data['student'] = $model->orderBy('id', 'ASE')->findAll();