codeigniter-project/app/Models/BookModel.php

    public function getRow($id){
        $getValue=$this->where('id',$id)->first();
---
SELECT *
FROM `books`
WHERE `id` = '1'
 LIMIT 1