codeigniter-project/app/Models/StudentModel.php

 public function getRow($id){
    $findValue=$this->where('id',$id)->first();
---
SELECT *
FROM `student`
WHERE `id` = '4'
 LIMIT 1